worker/tests/load/feature-flags-load.yml
# Artillery Load Test Configuration for Feature Flags
# Run with: npx artillery run tests/load/feature-flags-load.yml

config:
  target: 'http://localhost:8787'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 60
      arrivalRate: 100
      name: "Peak load"

  variables:
    userIds:
      - "load_user_1"
      - "load_user_2"
      - "load_user_3"
      - "load_user_4"
      - "load_user_5"
    
    flagNames:
      - "authentication"
      - "new_dashboard"
      - "checkout_flow"
      - "mobile_app"
      - "beta_features"

  processor: "./tests/load/flag-processor.js"

scenarios:
  # Test flag evaluation performance
  - name: "Flag Evaluation"
    weight: 70
    flow:
      - get:
          url: "/api/flags/{{ $randomString() }}"
          qs:
            userId: "{{ $pick(userIds) }}"
          headers:
            Authorization: "Bearer test-token"
          capture:
            - json: "$.enabled"
              as: "flagEnabled"
            - json: "$.variant"
              as: "flagVariant"
            - json: "$.reason"
              as: "flagReason"
          expect:
            - statusCode: 200
            - hasProperty: "enabled"

  # Test flag management API
  - name: "Flag Management"
    weight: 20
    flow:
      - post:
          url: "/api/flags/load_test_{{ $randomString() }}"
          headers:
            Authorization: "Bearer admin-token"
            Content-Type: "application/json"
          json:
            enabled: true
            rolloutPercentage: "{{ $randomInt(0, 100) }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/flags"
          headers:
            Authorization: "Bearer admin-token"
          expect:
            - statusCode: 200

  # Test route protection
  - name: "Protected Routes"
    weight: 10
    flow:
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer user-token"
          expect:
            - statusCode: [200, 401, 503]  # 503 if auth flag disabled

# Performance thresholds
expect:
  thresholds:
    - http.response_time.p95: 100  # 95% of requests under 100ms
    - http.response_time.p99: 200  # 99% of requests under 200ms
    - http.request_rate: 45        # At least 45 requests per second
    - http.codes.200: 95           # 95% success rate
    - http.codes.503: 5            # Allow some 503s for disabled features